Confinement_Study/Steady/noSlip_Case/0/psiI
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
/*
    periodic
    {
	type            cyclic;// zeroGradient;
    }

    periodic2
    {
	type            cyclic;// zeroGradient;
    }
*/


    wall
    {
	type            zeroGradient;
    }  
}

// ************************************************************************* //
